# cli tools

brew "coreutils"
brew "gpg"
brew "jq"
brew "git"
brew "git-lfs"
brew "git-trim"
brew "ack"
brew "zsh-completions"
brew "neovim"
brew "awscli"
brew "pgcli"
brew "terraform"
brew "asdf"
brew "watch"
brew "watchman"
brew "fd"
brew "tig"
brew "lazygit"
brew "rustup"
brew "glow"
brew "ngrok"

# Install GUI tools (Cask)
cask "spotify"
cask "wezterm"
cask "kitty"
cask "firefox"
cask "1password"
cask "ticktick"
cask "dropbox"
cask "orbstack"
cask "rectangle"
cask "postman"
cask "slack"

# Install fonts
tap "homebrew/cask-fonts"

cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-hack-nerd-font"
